Revit 2027 API
CurveArrArray.Item Property
Gets or sets an item at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CurveArray this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As CurveArray
	Get
	Set
public:
virtual property CurveArray^ Item[int index] {
	CurveArray^ get (int index);
	void set (int index, CurveArray^ value);
}
abstract Item : CurveArray with get, set
override Item : CurveArray with get, set
Parameters
index Int32
The index of the item to be set or retrieved.
Return Value
CurveArray
Returns the object at the specified index.
See Also
Reference
CurveArrArray Class
Autodesk.Revit.DB Namespace